---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetDimensions
source: html/e7cb5e57-cfb5-e1d9-8d98-6c99373de04e.htm
---
# Autodesk.Revit.DB.FabricationPart.GetDimensions Method

Gets all fabrication dimensions.

## Syntax (C#)
```csharp
public IList<FabricationDimensionDefinition> GetDimensions()
```

## Returns
Returns an array of fabrication dimensions.